Revit 2027 API
StairsComponentConnection.PeerElementId Property
 The element Id of peer connected stairs component in the stairs connection.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId PeerElementId { get; }
Public ReadOnly Property PeerElementId As ElementId
	Get
public:
property ElementId^ PeerElementId {
	ElementId^ get ();
}
member PeerElementId : ElementId with get
Property Value
ElementId
See Also
Reference
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace